{"behaviour":["Diseña y desarrolla componentes de software complejos que integran múltiples sistemas, aplicando patrones de diseño apropiados y principios SOLID.","Implementa soluciones técnicas que cumplen con los requisitos no funcionales (escalabilidad, rendimiento, seguridad) definidos en la arquitectura del programa de transformación.","Realiza revisiones de código estructuradas, proporcionando retroalimentación constructiva para mejorar la calidad y mantener la coherencia con los estándares del equipo.","Escribe pruebas automatizadas (unitarias, de integración) que validan la funcionalidad y robustez del código en el contexto del ecosistema digital.","Refactoriza código existente para mejorar su mantenibilidad y adaptarlo a nuevas necesidades del programa, documentando los cambios y su impacto.","Colabora con arquitectos y analistas para traducir especificaciones técnicas y de negocio en implementaciones de código eficientes y alineadas.","Diagnostica y resuelve problemas técnicos complejos en entornos de integración continua, utilizando herramientas de debugging y profiling.","Mantiene y mejora pipelines de CI\/CD, asegurando que el código se integre, pruebe y despliegue de manera fiable en los entornos objetivo."],"attitude":["Orientado a la calidad técnica: prioriza código limpio, mantenible y bien probado como base para una transformación digital sostenible.","Colaborativo y facilitador: actúa como un recurso técnico clave dentro del equipo, dispuesto a compartir conocimiento y guiar a miembros menos experimentados.","Proactivo en la identificación de riesgos técnicos y oportunidades de mejora en el código o los procesos de desarrollo.","Enfocado en la entrega de valor: alinea su trabajo técnico con los objetivos del programa de transformación y los resultados de negocio esperados.","Adaptable y con mentalidad de aprendizaje continuo, abierto a adoptar nuevas tecnologías o prácticas que beneficien al programa."],"responsibility":["Garantiza que el código desarrollado sea robusto, eficiente y cumpla con los estándares de calidad y las convenciones establecidas por el equipo y el programa.","Asegura la integración exitosa de sus componentes con otros sistemas dentro del ecosistema de transformación digital.","Responsable de la corrección de defectos y problemas de rendimiento en los módulos bajo su desarrollo, dentro de los plazos acordados.","Velar por que su trabajo esté adecuadamente documentado y sea comprensible para otros miembros del equipo, facilitando la mantenibilidad.","Contribuye activamente a la mejora de las prácticas de desarrollo, herramientas y procesos del equipo para aumentar la eficiencia y calidad."],"skills":["Dominio de uno o más lenguajes de programación relevantes para el stack tecnológico del programa (ej: Java, C#, Python, JavaScript\/TypeScript).","Experiencia en el diseño e implementación de APIs (REST, GraphQL) y comprensión de principios de integración de sistemas.","Conocimiento sólido de estructuras de datos, algoritmos y complejidad computacional para escribir código eficiente.","Habilidad para escribir pruebas automatizadas utilizando frameworks como JUnit, NUnit, pytest, Jest, etc.","Manejo de sistemas de control de versiones (Git) y comprensión de flujos de trabajo colaborativos (GitFlow, trunk-based).","Conocimiento práctico de principios de diseño de software (SOLID, DRY, KISS) y patrones de diseño comunes.","Familiaridad con conceptos de CI\/CD, contenedores (Docker) y orquestación básica, en el contexto del pipeline de despliegue.","Capacidad para realizar debugging complejo y profiling de aplicaciones para identificar cuellos de botella o errores."]}